#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.example.module.project_creation.google_project.project will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "01FD9A-D8330C-599F8F"
      + id                  = (known after apply)
      + labels              = {
          + "created_by" = "terraform"
        }
      + name                = (known after apply)
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.example.module.project_creation.google_project_iam_member.job_user["joebloggs@gmail.com"] will be created
  + resource "google_project_iam_member" "job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:joebloggs@gmail.com"
      + project = (known after apply)
      + role    = "roles/bigquery.jobUser"

      + condition {
          + expression = "request.time < timestamp(\"2021-08-14T00:00:00Z\")"
          + title      = "expires_on_2021-08-14"
        }
    }

  # module.example.module.project_creation.google_project_service.bigquery will be created
  + resource "google_project_service" "bigquery" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquery.googleapis.com"
    }

  # module.example.module.project_creation.google_project_service.iam will be created
  + resource "google_project_service" "iam" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # module.example.module.project_creation.random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.example1.module.project_creation.google_project.project will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "01FD9A-D8330C-599F8F"
      + id                  = (known after apply)
      + labels              = {
          + "created_by" = "terraform"
        }
      + name                = (known after apply)
      + number              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.example1.module.project_creation.google_project_iam_member.job_user["joebloggs@gmail.com"] will be created
  + resource "google_project_iam_member" "job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:joebloggs@gmail.com"
      + project = (known after apply)
      + role    = "roles/bigquery.jobUser"

      + condition {
          + expression = "request.time < timestamp(\"2021-08-14T00:00:00Z\")"
          + title      = "expires_on_2021-08-14"
        }
    }

  # module.example1.module.project_creation.google_project_service.bigquery will be created
  + resource "google_project_service" "bigquery" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquery.googleapis.com"
    }

  # module.example1.module.project_creation.google_project_service.iam will be created
  + resource "google_project_service" "iam" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # module.example1.module.project_creation.random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Luke-Scott, Action: `pull_request`, Workflow: `Terraform GitHub Actions`*